posts/learning-nasm-on-macos.org
#+SETUPFILE: ../org-templates/posts.org
#+MACRO: POST_TITLE Learning NASM on macOS 
#+INCLUDE: ../org-templates/posts_header.org
#+OPTIONS: ^:nil

** Introduction

I recently begun learning how to use NASM on macOS and thought I'd share a few tips. 

** Update your nasm

If you're using macOS and you try to compile an asm file with your default nasm
build, you'll probably get the following message:

: nasm: fatal: unrecognised output format `macho64' - use -hf for a list

Get a more up-to-date nasm build using [[http://brew.sh][Homebrew]]:

: $ brew install nasm
: $ nasm -v
: NASM version 0.98.40 (Apple Computer, Inc. build 11) compiled on Nov 15 2016

** Tutorials

Most tutorials for nasm are written with Linux in mind, so you'll usually need
to make a few adjustments to get things working on macOS.

[[https://gist.github.com/FiloSottile/7125822][NASM Hello World for x86 and x86_64 Intel Mac OS]] is a great place to start, and
the [[http://cs.lmu.edu/~ray/notes/nasmtutorial/][NASM Tutorial]] a great place to go from there (see section 
'Using NASM on macOS').

** System call numbers are different

System calls numbers on macOS are different to the numbers used on Linux (e.g.
'write' is '0x2000004' on macOS and '1' on Linux). [[http://www.idryman.org/blog/2014/12/02/writing-64-bit-assembly-on-mac-os-x/][Here's]] a link that shows why
this is the case. Essentially the higher-order bits of the number represent the
class of system call. You can find the system call numbers [[https://opensource.apple.com/source/xnu/xnu-1699.26.8/osfmk/mach/i386/syscall_sw.h][here]].

** Linking with the C standard library and the '_' prefix

When linking with the C standard library I usually use gcc and let it handle the linking for me:

: $ /usr/local/bin/nasm -f macho64 hello.asm
: $ gcc -arch x86_64 -o hello hello.o 

The symbol names in modules will be prefixed with an underscore, so it is necessary to
prefix your code with an underscore when referring to that symbol. For example, most
tutorials will be written for Linux and include something like this:

#+BEGIN_SRC asm
        global  main
        extern  puts

        section .text
main:
        call    puts
        ret
#+END_SRC

You'll instead need to do this:

#+BEGIN_SRC asm
        global  _main
        extern  _puts

        section .text
_main:
        call    _puts
        ret
#+END_SRC

The same goes for when exposing asm functions to C

#+BEGIN_SRC asm
  global _maxofthree

  section .text
_maxofthree:
  ; ...
  ret
#+END_SRC

** Lea and Rel

As mentioned in the [[http://cs.lmu.edu/~ray/notes/nasmtutorial/][NASM Tutorial]], macOS doesn't allow absolute addressing by
default. The tutorial suggests that you: "default rel when you are
referencing labeled memory locations, and always use lea to get your addresses",
but what does that actually mean?

#+BEGIN_SRC asm
; ------------------------------------------------------------------------------
; Writes "Hola, mundo" to the console using a C library. Runs on Linux or any
; other system that does not use underscores for symbols in its C library. To
; assemble and run:
;
; 	/usr/local/bin/nasm -f macho64 hola.asm && gcc -arch x86_64 -o hola hola.o && ./hola
; ------------------------------------------------------------------------------

  global _main
  extern _puts

  section .text
_main:                          
  sub     rsp, 8                
                                
  lea     rdi, [message]        ; Use this instead of 'mov rdi, message' 
  call    _puts                 
  add     rsp, 8                
  ret                           

  section .data
message:
default rel                     ; Add 'default rel' under label
  db   "Hola, mundo",0          
#+END_SRC

Pretty simple :)

