docs/posts/learning-nasm-on-macos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-05 Mon 14:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Samuel Evans-Powell</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Samuel Evans-Powell" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Samuel Evans-Powell</h1>
<p>
<a id="org57c827f"></a>
<a href="../index.html">&lt; Home</a>
</p>

<div id="outline-container-org05206d3" class="outline-2">
<h2 id="org05206d3">Learning NASM on macOS</h2>
<div class="outline-text-2" id="text-org05206d3">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org05206d3">Learning NASM on macOS</a>
<ul>
<li><a href="#org0fb82b0">Introduction</a></li>
<li><a href="#org7aa226c">Update your nasm</a></li>
<li><a href="#orge2cf32f">Tutorials</a></li>
<li><a href="#orgddf2e4d">System call numbers are different</a></li>
<li><a href="#orgea10f92">Linking with the C standard library and the '_' prefix</a></li>
<li><a href="#orgcd3c116">Lea and Rel</a></li>
<li><a href="#org4ea544f">The Stack Frame</a></li>
<li><a href="#org3b4f639">Resources</a></li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0fb82b0" class="outline-3">
<h3 id="org0fb82b0">Introduction</h3>
<div class="outline-text-3" id="text-org0fb82b0">
<p>
I recently begun learning how to use NASM on macOS and thought I'd share a few tips.
</p>
</div>
</div>

<div id="outline-container-org7aa226c" class="outline-3">
<h3 id="org7aa226c">Update your nasm</h3>
<div class="outline-text-3" id="text-org7aa226c">
<p>
If you're using macOS and you try to compile an asm file with your default nasm
build, you'll probably get the following message:
</p>

<pre class="example">
nasm: fatal: unrecognised output format `macho64' - use -hf for a list

</pre>

<p>
Get a more up-to-date nasm build using <a href="http://brew.sh">Homebrew</a>:
</p>

<pre class="example">
$ brew install nasm
$ nasm -v
NASM version 0.98.40 (Apple Computer, Inc. build 11) compiled on Nov 15 2016

</pre>
</div>
</div>

<div id="outline-container-orge2cf32f" class="outline-3">
<h3 id="orge2cf32f">Tutorials</h3>
<div class="outline-text-3" id="text-orge2cf32f">
<p>
Most tutorials for nasm are written with Linux in mind, so you'll usually need
to make a few adjustments to get things working on macOS.
</p>

<p>
<a href="https://gist.github.com/FiloSottile/7125822">NASM Hello World for x86 and x86_64 Intel Mac OS</a> is a great place to start, and
the <a href="http://cs.lmu.edu/~ray/notes/nasmtutorial/">NASM Tutorial</a> a great place to go from there (see section
'Using NASM on macOS').
</p>
</div>
</div>

<div id="outline-container-orgddf2e4d" class="outline-3">
<h3 id="orgddf2e4d">System call numbers are different</h3>
<div class="outline-text-3" id="text-orgddf2e4d">
<p>
System calls numbers on macOS are different to the numbers used on Linux (e.g.
'write' is '0x2000004' on macOS and '1' on Linux). <a href="http://www.idryman.org/blog/2014/12/02/writing-64-bit-assembly-on-mac-os-x/">Here's</a> a link that shows why
this is the case. Essentially the higher-order bits of the number represent the
class of system call. You can find the system call numbers <a href="https://opensource.apple.com/source/xnu/xnu-1699.26.8/osfmk/mach/i386/syscall_sw.h">here</a>.
</p>
</div>
</div>

<div id="outline-container-orgea10f92" class="outline-3">
<h3 id="orgea10f92">Linking with the C standard library and the '_' prefix</h3>
<div class="outline-text-3" id="text-orgea10f92">
<p>
When linking with the C standard library I usually use gcc and let it handle the linking for me:
</p>

<pre class="example">
$ /usr/local/bin/nasm -f macho64 hello.asm
$ gcc -arch x86_64 -o hello hello.o

</pre>

<p>
The symbol names in modules will be prefixed with an underscore, so it is necessary to
prefix your code with an underscore when referring to that symbol. For example, most
tutorials will be written for Linux and include something like this:
</p>

<div class="org-src-container">
<pre class="src src-asm">        <span style="color: #bf568b;">global</span>  main&#57344;&#57345;&#57345;
        <span style="color: #bf568b;">extern</span>  puts&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
        <span style="color: #bf568b;">section</span> .text&#57344;&#57345;&#57345;
<span style="color: #8b56bf;">main</span>:&#57344;&#57345;&#57345;
        <span style="color: #bf568b;">call</span>    puts&#57344;&#57345;&#57345;
        <span style="color: #bf568b;">ret</span>
</pre>
</div>

<p>
You'll instead need to do this:
</p>

<div class="org-src-container">
<pre class="src src-asm">        <span style="color: #bf568b;">global</span>  _main&#57344;&#57345;&#57345;
        <span style="color: #bf568b;">extern</span>  _puts&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
        <span style="color: #bf568b;">section</span> .text&#57344;&#57345;&#57345;
<span style="color: #8b56bf;">_main</span>:&#57344;&#57345;&#57345;
        <span style="color: #bf568b;">call</span>    _puts&#57344;&#57345;&#57345;
        <span style="color: #bf568b;">ret</span>
</pre>
</div>

<p>
The same goes for when exposing asm functions to C:
</p>

<div class="org-src-container">
<pre class="src src-asm">  <span style="color: #bf568b;">global</span> _maxofthree&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">section</span> .text&#57344;&#57345;&#57345;
<span style="color: #8b56bf;">_maxofthree</span>:&#57344;&#57345;&#57345;
  <span style="color: #405c79;">; </span><span style="color: #627e99;">...</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">ret</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd3c116" class="outline-3">
<h3 id="orgcd3c116">Lea and Rel</h3>
<div class="outline-text-3" id="text-orgcd3c116">
<p>
As mentioned in the <a href="http://cs.lmu.edu/~ray/notes/nasmtutorial/">NASM Tutorial</a>, macOS doesn't allow absolute addressing by
default. The tutorial suggests that you: "default rel when you are
referencing labeled memory locations, and always use lea to get your addresses",
but what does that actually mean?
</p>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #405c79;">; </span><span style="color: #627e99;">------------------------------------------------------------------------------</span>&#57345;
<span style="color: #405c79;">; </span><span style="color: #627e99;">Writes "Hola, mundo" to the console using a C library. Runs on Linux or any</span>&#57344;&#57345;&#57345;
<span style="color: #405c79;">; </span><span style="color: #627e99;">other system that does not use underscores for symbols in its C library. To</span>&#57344;&#57345;&#57345;
<span style="color: #405c79;">; </span><span style="color: #627e99;">assemble and run:</span>&#57344;&#57345;&#57345;
<span style="color: #405c79;">;</span>&#57344;&#57345;&#57345;
<span style="color: #405c79;">;   </span><span style="color: #627e99;">/usr/local/bin/nasm -f macho64 hola.asm &amp;&amp; gcc -arch x86_64 -o hola hola.o &amp;&amp; ./hola</span>&#57344;&#57345;
<span style="color: #405c79;">; </span><span style="color: #627e99;">------------------------------------------------------------------------------</span>&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">global</span> _main&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">extern</span> _puts&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">section</span> .text&#57344;&#57345;&#57345;
<span style="color: #8b56bf;">_main</span>:&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">sub</span>     rsp, 8&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">lea</span>     rdi, <span style="color: #bf568b;">[</span>message<span style="color: #bf568b;">]</span>        <span style="color: #405c79;">; </span><span style="color: #627e99;">Use this instead of 'mov rdi, message'</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">call</span>    _puts&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">add</span>     rsp, 8&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">ret</span>&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">section</span> .data&#57344;&#57345;&#57345;
<span style="color: #8b56bf;">message</span>:&#57344;&#57345;&#57345;
<span style="color: #8b56bf;">default</span> <span style="color: #bf568b;">rel</span>                     <span style="color: #405c79;">; </span><span style="color: #627e99;">Add 'default rel' under label</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">db</span>   <span style="color: #56bf8b;">"Hola, mundo"</span>,0
</pre>
</div>

<p>
Pretty simple :)
</p>
</div>
</div>
