docs/posts/learning-nasm-on-macos.html

<div id="outline-container-org4ea544f" class="outline-3">
<h3 id="org4ea544f">The Stack Frame</h3>
<div class="outline-text-3" id="text-org4ea544f">
<p>
Probably the most painful thing I encountered was this line from the
<a href="https://web.archive.org/web/20160304042454/http://x86-64.org/documentation/abi.pdf">AMD64 ABI Reference</a> (page 16):
</p>

<pre class="example">
"The end of the input argument area shall be aligned on a 16 (32, if __m256 is passed on stack) byte boundary. In other words, the value (%rsp + 8) is always a multiple of 16 (32) when control is transferred to the function entry point.

</pre>

<p>
What this means is that the stack pointer (rsp) needs to be a multiple of 16
(rsp % 16 == 0) before control is passed to another function.
</p>

<p>
Practically, all this translates to is that depending on the current state of
your stack you need to subtract a certain amount from your stack pointer
(in our case the stack grows towards lower memory addresses) in order to pad the
stack so it's address is 16-byte aligned. What you must keep in mind though is
that the 'call' instruction will automatically push the return address
(8 bytes - 64-bit) onto the stack. You must also remember to add to the stack
pointer (shrink the stack) so that it's pointing to the same address it was
before padding.
</p>

<p>
A simple "Hola, mundo" nasm program that demonstrates what we need to do is
shown below (modified from the <a href="http://cs.lmu.edu/~ray/notes/nasmtutorial/">NASM Tutorial</a>):
</p>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #405c79;">; </span><span style="color: #627e99;">------------------------------------------------------------------------------</span>&#57345;
<span style="color: #405c79;">; </span><span style="color: #627e99;">Writes "Hola, mundo" to the console using a C library. Runs on Linux or any</span>&#57344;&#57345;&#57345;
<span style="color: #405c79;">; </span><span style="color: #627e99;">other system that does not use underscores for symbols in its C library. To</span>&#57344;&#57345;&#57345;
<span style="color: #405c79;">; </span><span style="color: #627e99;">assemble and run:</span>&#57344;&#57345;&#57345;
<span style="color: #405c79;">;</span>&#57344;&#57345;&#57345;
<span style="color: #405c79;">;   </span><span style="color: #627e99;">/usr/local/bin/nasm -f macho64 hola.asm &amp;&amp; gcc -arch x86_64 -o hola hola.o &amp;&amp; ./hola</span>&#57344;&#57345;
<span style="color: #405c79;">; </span><span style="color: #627e99;">------------------------------------------------------------------------------</span>&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">global</span> _main&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">extern</span> _puts&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">section</span> .text&#57344;&#57345;&#57345;
<span style="color: #8b56bf;">_main</span>:&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">sub</span>     rsp, 8                <span style="color: #405c79;">; </span><span style="color: #627e99;">Pad stack frame as required for 64-bit OSX</span>&#57344;&#57345;&#57345;
                                <span style="color: #405c79;">;  </span><span style="color: #627e99;">- we know the 'call' instruction will add</span>&#57344;&#57345;&#57345;
                                <span style="color: #405c79;">;    </span><span style="color: #627e99;">8 bytes to the stack, so we pad it with</span>&#57344;&#57345;&#57345;
                                <span style="color: #405c79;">;    </span><span style="color: #627e99;">another 8 bytes.</span>&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">lea</span>     rdi, <span style="color: #bf568b;">[</span>message<span style="color: #bf568b;">]</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">call</span>    _puts&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">add</span>     rsp, 8                <span style="color: #405c79;">; </span><span style="color: #627e99;">Get our old stack pointer back by removing our</span>&#57345;
                                <span style="color: #405c79;">; </span><span style="color: #627e99;">previous padding</span>&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">ret</span>&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">section</span> .data&#57344;&#57345;&#57345;
<span style="color: #8b56bf;">message</span>:&#57344;&#57345;&#57345;
<span style="color: #8b56bf;">default</span> <span style="color: #bf568b;">rel</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">db</span>   <span style="color: #56bf8b;">"Hola, mundo"</span>,0          <span style="color: #405c79;">; </span><span style="color: #627e99;">Note that strings must be terminated with 0</span>&#57344;&#57345;&#57345;
                                <span style="color: #405c79;">;  </span><span style="color: #627e99;">in C</span>
</pre>
</div>

<p>
You can see that we subtract 8 bytes from the stack pointer (rsp) to pad the
stack with 8 extra bytes. This compensates for the 8 bytes added to the stack by
the 'call' instruction before it enters the 'puts' function, thereby ensuring
that our stack pointer is a multiple of 16 before control is passed to the
function.
</p>

<p>
Note that we don't always need to subtract and add 8 bytes from the stack
pointer, this number will vary depending on the current state of your stack. For
example, in the following program we add no bytes to the stack pointer, it's
already 16-byte aligned (modified from the <a href="http://cs.lmu.edu/~ray/notes/nasmtutorial/">NASM Tutorial</a>):
</p>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #405c79;">; </span><span style="color: #627e99;">-----------------------------------------------------------------------------</span>&#57344;&#57345;&#57345;
<span style="color: #405c79;">; </span><span style="color: #627e99;">A 64-bit Mac OSX application that writes the first 90 Fibonacci numbers. To</span>&#57344;&#57345;&#57345;
<span style="color: #405c79;">; </span><span style="color: #627e99;">assemble and run:</span>&#57344;&#57345;&#57345;
<span style="color: #405c79;">;</span>&#57344;&#57345;&#57345;
<span style="color: #405c79;">;     </span><span style="color: #627e99;">/usr/local/bin/nasm -f macho64 fib.asm &amp;&amp; gcc -arch x86_64 -o fib fib.o &amp;&amp; ./fib</span>&#57344;&#57345;
<span style="color: #405c79;">; </span><span style="color: #627e99;">-----------------------------------------------------------------------------</span>&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">global</span> _main&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">extern</span> _printf&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">section</span> .text&#57344;&#57345;&#57345;
<span style="color: #8b56bf;">_main</span>:&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">push</span>    rbx                   <span style="color: #405c79;">; </span><span style="color: #627e99;">we have to save this since we use it</span>&#57344;&#57345;&#57345;
                                <span style="color: #405c79;">;  </span><span style="color: #627e99;">(we are required to preserve rbx)</span>&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">mov</span>     ecx, 90               <span style="color: #405c79;">; </span><span style="color: #627e99;">ecx will countdown to 0</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">xor</span>     rax, rax              <span style="color: #405c79;">; </span><span style="color: #627e99;">rax will hold the current number (clear to 0)</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">xor</span>     rbx, rbx              <span style="color: #405c79;">; </span><span style="color: #627e99;">rbx will hold the next number (clear to 0)</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">inc</span>     rbx                   <span style="color: #405c79;">; </span><span style="color: #627e99;">rbx is originally 1</span>&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
<span style="color: #8b56bf;">print</span>:&#57344;&#57345;&#57345;
  <span style="color: #405c79;">; </span><span style="color: #627e99;">We need to call printf, but we are using rax, rbx and rcx. printf may</span>&#57344;&#57345;&#57345;
  <span style="color: #405c79;">; </span><span style="color: #627e99;">destroy rax and rcx, so we will save these before the call and restore them</span>&#57344;&#57345;&#57345;
  <span style="color: #405c79;">; </span><span style="color: #627e99;">afterwards.</span>&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">push</span>    rax                   <span style="color: #405c79;">; </span><span style="color: #627e99;">caller - save register</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">push</span>    rcx                   <span style="color: #405c79;">; </span><span style="color: #627e99;">caller - save register</span>&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">lea</span>     rdi, <span style="color: #bf568b;">[</span>format<span style="color: #bf568b;">]</span>         <span style="color: #405c79;">; </span><span style="color: #627e99;">set 1st parameter (format)</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">mov</span>     rsi, rax              <span style="color: #405c79;">; </span><span style="color: #627e99;">set 2nd parameter (current_number)</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">xor</span>     rax, rax              <span style="color: #405c79;">; </span><span style="color: #627e99;">zero rax before call to printf</span>&#57344;&#57345;&#57345;
                                <span style="color: #405c79;">;  </span><span style="color: #627e99;">note that rax is used to indicate the number</span>&#57344;&#57345;&#57345;
                                <span style="color: #405c79;">;  </span><span style="color: #627e99;">of vector registers used with variable arg</span>&#57344;&#57345;&#57345;
                                <span style="color: #405c79;">;  </span><span style="color: #627e99;">functions (such as printf)</span>&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #405c79;">; </span><span style="color: #627e99;">Stack is already aligned because we pushed three 8-byte registers and the</span>&#57344;&#57345;&#57345;
  <span style="color: #405c79;">; </span><span style="color: #627e99;">call instruction will push the return address (which on a 64-bit machine,</span>&#57344;&#57345;&#57345;
  <span style="color: #405c79;">; </span><span style="color: #627e99;">is 8 bytes). This gives us 32 bytes total, meaning the stack pointer is</span>&#57344;&#57345;&#57345;
  <span style="color: #405c79;">; </span><span style="color: #627e99;">already 16-byte aligned.</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">call</span>    _printf               <span style="color: #405c79;">; </span><span style="color: #627e99;">printf(format, current_number)</span>&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">pop</span>     rcx                   <span style="color: #405c79;">; </span><span style="color: #627e99;">restore caller-saved register</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">pop</span>     rax                   <span style="color: #405c79;">; </span><span style="color: #627e99;">restore caller-saved register</span>&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">mov</span>     rdx, rax              <span style="color: #405c79;">; </span><span style="color: #627e99;">save the current number</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">mov</span>     rax, rbx              <span style="color: #405c79;">; </span><span style="color: #627e99;">next number is now current</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">add</span>     rbx, rdx              <span style="color: #405c79;">; </span><span style="color: #627e99;">get the new next number (fibonacci seq.)</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">dec</span>     ecx                   <span style="color: #405c79;">; </span><span style="color: #627e99;">count down</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">jnz</span>     print                 <span style="color: #405c79;">; </span><span style="color: #627e99;">continue until counter reaches 0</span>&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">pop</span>     rbx                   <span style="color: #405c79;">; </span><span style="color: #627e99;">restore rbx before returning</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">ret</span>&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
<span style="color: #8b56bf;">format</span>:&#57344;&#57345;&#57345;
<span style="color: #8b56bf;">default</span> <span style="color: #bf568b;">rel</span>&#57344;&#57345;&#57345;
  <span style="color: #bf568b;">db</span>    <span style="color: #56bf8b;">"%20ld"</span>, 10, 0
</pre>
</div>
</div>
</div>
